---
kind: property
id: P:Autodesk.Revit.DB.ModelText.Location
source: html/474ce773-f3f2-d095-0531-5791d1f7740d.htm
---
# Autodesk.Revit.DB.ModelText.Location Property

This property is used to find the physical location of an instance within project.

## Syntax (C#)
```csharp
public override Location Location { get; }
```